## Terraform Plan - live - Part 1 of 1

<details>

<summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.telegram_bot.aws_iam_role_policy.lambda_ssm_permissions must be replaced
-/+ resource "aws_iam_role_policy" "lambda_ssm_permissions" {
      ~ id     = "imateapot-bot-e1297ecbba670af5:ssm-permissions" -> (known after apply)
        name   = "ssm-permissions"
      ~ role   = "imateapot-bot-e1297ecbba670af5" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.telegram_bot.aws_lambda_function_url.this will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "imateapot-bot"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + qualifier          = "live"
      + url_id             = (known after apply)
    }

  # module.telegram_bot.aws_lambda_permission.this will be destroyed
  # (because aws_lambda_permission.this is not in configuration)
  - resource "aws_lambda_permission" "this" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "imateapot-bot-e1297ecbba670af5" -> null
      - id            = "ApiGatewayInvoke" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:420770249343:q5h3kb7iwl/*" -> null
      - statement_id  = "ApiGatewayInvoke" -> null
    }

  # module.telegram_bot.module.alias.aws_lambda_alias.with_refresh[0] will be created
  + resource "aws_lambda_alias" "with_refresh" {
      + arn              = (known after apply)
      + function_name    = "imateapot-bot"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "live"
    }

  # module.telegram_bot.module.deploy.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "codedeploy.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.telegram_bot.module.deploy.data.aws_lambda_alias.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_alias" "this" {
      + arn              = (known after apply)
      + description      = (known after apply)
      + function_name    = "imateapot-bot"
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "live"
    }

  # module.telegram_bot.module.deploy.data.aws_lambda_function.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_signing_config_arn        = (known after apply)
      + dead_letter_config             = (known after apply)
      + description                    = (known after apply)
      + environment                    = (known after apply)
      + ephemeral_storage              = (known after apply)
      + file_system_config             = (known after apply)
      + function_name                  = "imateapot-bot"
      + handler                        = (known after apply)
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = (known after apply)
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + qualifier                      = (known after apply)
      + reserved_concurrent_executions = (known after apply)
      + role                           = (known after apply)
      + runtime                        = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + timeout                        = (known after apply)
      + tracing_config                 = (known after apply)
      + version                        = (known after apply)
      + vpc_config                     = (known after apply)
    }

  # module.telegram_bot.module.deploy.aws_codedeploy_app.this[0] will be created
  + resource "aws_codedeploy_app" "this" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Lambda"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "imateapot-bot"
      + tags_all            = (known after apply)
    }

  # module.telegram_bot.module.deploy.aws_codedeploy_deployment_group.this[0] will be created
  + resource "aws_codedeploy_deployment_group" "this" {
      + app_name               = "imateapot-bot"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = "CodeDeployDefault.LambdaAllAtOnce"
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "default"
      + id                     = (known after apply)
      + service_role_arn       = (known after apply)
      + tags_all               = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_STOP_ON_ALARM",
            ]
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }
    }

  # module.telegram_bot.module.deploy.aws_iam_role.codedeploy[0] will be created
  + resource "aws_iam_role" "codedeploy" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "imateapot-bot-codedeploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.telegram_bot.module.deploy.aws_iam_role_policy_attachment.codedeploy[0] will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRoleForLambda"
      + role       = (known after apply)
    }

  # module.telegram_bot.module.deploy.null_resource.deploy[0] will be created
  + resource "null_resource" "deploy" {
      + id       = (known after apply)
      + triggers = {
          + "appspec_sha256" = (known after apply)
          + "force_deploy"   = (known after apply)
        }
    }

  # module.telegram_bot.module.lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.telegram_bot.module.lambda.data.aws_cloudwatch_log_group.lambda[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + creation_time     = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = "/aws/lambda/imateapot-bot"
      + retention_in_days = (known after apply)
      + tags              = (known after apply)
    }

  # module.telegram_bot.module.lambda.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.telegram_bot.module.lambda.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.telegram_bot.module.lambda.aws_cloudwatch_log_group.this will be destroyed
  # (because aws_cloudwatch_log_group.this is not in configuration)
  - resource "aws_cloudwatch_log_group" "this" {
      - arn               = "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot-e1297ecbba670af5" -> null
      - id                = "/aws/lambda/imateapot-bot-e1297ecbba670af5" -> null
      - name              = "/aws/lambda/imateapot-bot-e1297ecbba670af5" -> null
      - retention_in_days = 14 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # module.telegram_bot.module.lambda.aws_iam_role.lambda_exec will be destroyed
  # (because aws_iam_role.lambda_exec is not in configuration)
  - resource "aws_iam_role" "lambda_exec" {
      - arn                   = "arn:aws:iam::420770249343:role/imateapot-bot-e1297ecbba670af5" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-06-06T19:08:25Z" -> null
      - force_detach_policies = true -> null
      - id                    = "imateapot-bot-e1297ecbba670af5" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess",
          - "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "imateapot-bot-e1297ecbba670af5" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-06-12T00:16:49Z"
              - region         = "us-east-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAWD564PJ7RTWBB42IS" -> null

      - inline_policy {
          - name   = "lambda-permissions" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot-e1297ecbba670af5:*:*",
                              - "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot-e1297ecbba670af5:*",
                              - "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot-e1297ecbba670af5",
                            ]
                          - Sid      = "logs"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "ssm-permissions" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "ssm:DescribeParameters"
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = "SSMDescribe"
                        },
                      - {
                          - Action   = [
                              - "ssm:GetParametersByPath",
                              - "ssm:GetParameters",
                              - "ssm:GetParameterHistory",
                              - "ssm:GetParameter",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:ssm:us-east-1:420770249343:parameter/telegram-bot/imateapot/token",
                              - "arn:aws:ssm:us-east-1:420770249343:parameter/telegram-bot/imateapot/secret",
                              - "arn:aws:ssm:us-east-1:420770249343:parameter/andreswebs/openai/api-key",
                            ]
                          - Sid      = "SSMGet"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.telegram_bot.module.lambda.aws_iam_role_policy.lambda_permissions will be destroyed
  # (because aws_iam_role_policy.lambda_permissions is not in configuration)
  - resource "aws_iam_role_policy" "lambda_permissions" {
      - id     = "imateapot-bot-e1297ecbba670af5:lambda-permissions" -> null
      - name   = "lambda-permissions" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot-e1297ecbba670af5:*:*",
                          - "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot-e1297ecbba670af5:*",
                          - "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot-e1297ecbba670af5",
                        ]
                      - Sid      = "logs"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "imateapot-bot-e1297ecbba670af5" -> null
    }

  # module.telegram_bot.module.lambda.aws_iam_role_policy_attachment.lambda_insights[0] will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_insights is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_insights" {
      - id         = "imateapot-bot-e1297ecbba670af5-20230606190826456400000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy" -> null
      - role       = "imateapot-bot-e1297ecbba670af5" -> null
    }

  # module.telegram_bot.module.lambda.aws_iam_role_policy_attachment.xray_permissions[0] will be destroyed
  # (because aws_iam_role_policy_attachment.xray_permissions is not in configuration)
  - resource "aws_iam_role_policy_attachment" "xray_permissions" {
      - id         = "imateapot-bot-e1297ecbba670af5-20230606190826059700000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess" -> null
      - role       = "imateapot-bot-e1297ecbba670af5" -> null
    }

  # module.telegram_bot.module.lambda.aws_lambda_function.this[0] must be replaced
  # (moved from module.telegram_bot.module.lambda.aws_lambda_function.this)
-/+ resource "aws_lambda_function" "this" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:420770249343:function:imateapot-bot-e1297ecbba670af5" -> (known after apply)
      ~ function_name                  = "imateapot-bot-e1297ecbba670af5" -> "imateapot-bot" # forces replacement
      ~ id                             = "imateapot-bot-e1297ecbba670af5" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:420770249343:function:imateapot-bot-e1297ecbba670af5/invocations" -> (known after apply)
      ~ last_modified                  = "2023-06-12T00:09:13.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ publish                        = false -> true
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:420770249343:function:imateapot-bot-e1297ecbba670af5:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:420770249343:function:imateapot-bot-e1297ecbba670af5:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::420770249343:role/imateapot-bot-e1297ecbba670af5" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "9df07d06434090d6640f691a824902ecc695437ec3865fcea48ddc6e944f55c9" -> (known after apply)
      ~ source_code_size               = 0 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (7 unchanged attributes hidden)

      + timeouts {}

      - tracing_config {
          - mode = "Active" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.telegram_bot.module.lambda.random_id.id will be destroyed
  # (because random_id.id is not in configuration)
  - resource "random_id" "id" {
      - b64_std     = "4Sl+y7pnCvU=" -> null
      - b64_url     = "4Sl-y7pnCvU" -> null
      - byte_length = 8 -> null
      - dec         = "16224638546049698549" -> null
      - hex         = "e1297ecbba670af5" -> null
      - id          = "4Sl-y7pnCvU" -> null
    }

  # module.telegram_bot.module.lambda_base.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/imateapot-bot"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.telegram_bot.module.lambda_base.aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "imateapot-bot"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.telegram_bot.module.lambda_base.aws_iam_role_policy.lambda_permissions will be created
  + resource "aws_iam_role_policy" "lambda_permissions" {
      + id     = (known after apply)
      + name   = "lambda-permissions"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot:*:*",
                          + "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot:*",
                          + "arn:aws:logs:us-east-1:420770249343:log-group:/aws/lambda/imateapot-bot",
                        ]
                      + Sid      = "logs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.telegram_bot.module.lambda_base.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.telegram_bot.module.lambda_base.aws_iam_role_policy_attachment.xray_permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "xray_permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess"
      + role       = (known after apply)
    }

  # module.telegram_bot.module.lambda_base.random_id.id will be created
  + resource "random_id" "id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 15 to add, 0 to change, 9 to destroy.

Changes to Outputs:
  ~ invoke_url = "https://q5h3kb7iwl.execute-api.us-east-1.amazonaws.com/v1" -> (known after apply)


```

</details>

**Triggered by @andreswebs, Event `pull_request`**
